bemcgarvey/RX12G/software/RX12GConfig/mainwindow.cpp
#include "mainwindow.h"
#include "ui_mainwindow.h"
#include "RX12G.h"
#include <QMessageBox>

MainWindow::MainWindow(QWidget *parent)
    : QMainWindow(parent), usb(64, false)
    , ui(new Ui::MainWindow)
{
    ui->setupUi(this);
    connectLabel = new QLabel("Not connected");
    ui->statusbar->addPermanentWidget(connectLabel);
    hidWatcher = new QHidWatcher(PID, VID, this);
    connect(hidWatcher, &QHidWatcher::connected, this, &MainWindow::onUsbConnected);
    connect(hidWatcher, &QHidWatcher::removed, this, &MainWindow::onUsbRemoved);
    channelsTimer = new QTimer(this);
    connect(channelsTimer, &QTimer::timeout, this, &MainWindow::onChannelTimout);
    sensorTimer = new QTimer(this);
    connect(sensorTimer, &QTimer::timeout, this, &MainWindow::onSensorTimout);
    channelBars[0] = ui->ch1ProgressBar;
    channelBars[1] = ui->ch2ProgressBar;
    channelBars[2] = ui->ch3ProgressBar;
    channelBars[3] = ui->ch4ProgressBar;
    channelBars[4] = ui->ch5ProgressBar;
    channelBars[5] = ui->ch6ProgressBar;
    channelBars[6] = ui->ch7ProgressBar;
    channelBars[7] = ui->ch8ProgressBar;
    channelBars[8] = ui->ch9ProgressBar;
    channelBars[9] = ui->ch10ProgressBar;
    channelBars[10] = ui->ch11ProgressBar;
    channelBars[11] = ui->ch12ProgressBar;
}

MainWindow::~MainWindow()
{
    delete ui;
}

uint32_t MainWindow::calculateChecksum(uint32_t *data, int len)
{
    uint32_t crc = 0x12345678;
    while (len > 0) {
        crc ^= *data;
        ++data;
        --len;
    }
    return crc;
}

void MainWindow::onUsbConnected()
{
    on_connectPushButton_clicked();
}

void MainWindow::onUsbRemoved()
{
    if (usb.Connected()) {
        usb.Close();
    }
    connectLabel->setText("Not connected");
    ui->loadPushButton->setEnabled(false);
    ui->savePushButton->setEnabled(false);
    channelsTimer->stop();
    for (int i = 0; i < 12; ++i) {
        channelBars[i]->setValue(0);
        channelBars[i]->setEnabled(false);
    }
}

void MainWindow::on_loadPushButton_clicked()
{
    buffer[0] = GET_SETTINGS;
    usb.SendReport(buffer);
    usb.GetReport(buffer);
    uint32_t crc = calculateCRC(buffer, sizeof(Settings));
    uint32_t sentCRC;
    memcpy(&sentCRC, &buffer[sizeof(Settings)], sizeof(uint32_t));
    if (crc != sentCRC) {
        QMessageBox::critical(this, QApplication::applicationName(), "Error loading settings");
        return;
    }
    Settings settings;
    memcpy(&settings, buffer, sizeof(Settings));
    if (settings.numSBusOutputs > 0) {
        ui->sbusEnableCheckBox->setChecked(true);
    } else {
        ui->sbusEnableCheckBox->setChecked(false);
    }
    ui->sbusOutputsSpinBox->setValue(settings.numSBusOutputs);
    ui->sbusPeriodSpinBox->setValue(settings.sBusPeriodMs);
    switch(settings.outputHz) {
    case 50:
        ui->servoRateComboBox->setCurrentIndex(0);
        break;
    case 100:
        ui->servoRateComboBox->setCurrentIndex(1);
        break;
    case 200:
        ui->servoRateComboBox->setCurrentIndex(2);
        break;
    }
    if (settings.failsafeType == NORMAL_FAILSAFE) {
        ui->normalFailsafeRadioButton->setChecked(true);
        ui->presetFailsafeRadioButton->setChecked(false);
        ui->savePresetsPushButton->setEnabled(false);
    } else {
        ui->normalFailsafeRadioButton->setChecked(false);
        ui->presetFailsafeRadioButton->setChecked(true);
        ui->savePresetsPushButton->setEnabled(true);
    }
    ui->statusbar->showMessage("Settings loaded.", 2000);
}


void MainWindow::on_connectPushButton_clicked()
{
    if (usb.Connected()) {
        usb.Close();
    }
    usb.Open(PID, VID);
    if (usb.Connected()) {
        buffer[0] = GET_VERSION;
        usb.SendReport(buffer);
        usb.GetReport(buffer);
        QString version = QString("Firmware Version %1.%2").arg(buffer[1]).arg(buffer[0]);
        connectLabel->setText("Connected: " + version);
        ui->loadPushButton->setEnabled(true);
        ui->savePushButton->setEnabled(true);
        on_tabWidget_currentChanged(ui->tabWidget->currentIndex());
    } else {
        connectLabel->setText("Not connected");
        ui->loadPushButton->setEnabled(false);
        ui->savePushButton->setEnabled(false);
        channelsTimer->stop();
        sensorTimer->stop();
        for (int i = 0; i < 12; ++i) {
            channelBars[i]->setValue(0);
            channelBars[i]->setEnabled(false);
        }
    }
}


void MainWindow::on_savePushButton_clicked()
{
    Settings settings;
    if (ui->sbusEnableCheckBox->isChecked()) {
        settings.numSBusOutputs = ui->sbusOutputsSpinBox->value();
        settings.sBusPeriodMs = ui->sbusPeriodSpinBox->value();
    } else {
        settings.numSBusOutputs = 0;
        settings.sBusPeriodMs = 7;
    }
    switch (ui->servoRateComboBox->currentIndex()) {
        case 0: settings.outputHz = 50;
        break;
    case 1: settings.outputHz = 100;
        break;
    case 2: settings.outputHz = 200;
        break;
    default: settings.outputHz = 50;
        break;
    }
    if (ui->normalFailsafeRadioButton->isChecked()) {
        settings.failsafeType = NORMAL_FAILSAFE;
    } else {
        settings.failsafeType = PRESET_FAILSAFE;
    }
    buffer[0] = SAVE_SETTINGS;
    memcpy(&buffer[1], &settings, sizeof(settings));
    uint32_t crc = calculateCRC(&settings, sizeof(Settings));
    memcpy(&buffer[sizeof(Settings) + 1], &crc, sizeof(uint32_t));
    usb.SendReport(buffer);
    usb.GetReport(buffer);
    if (buffer[0] == CMD_ACK) {
        ui->statusbar->showMessage("Settings saved", 2000);
    } else {
        QMessageBox::critical(this, QApplication::applicationName(), "Unable to save settings");
    }
}


void MainWindow::on_actionExit_triggered()
{
    close();
}


void MainWindow::on_sbusEnableCheckBox_stateChanged(int arg1)
{
    if (arg1) {
        ui->sbusOutputsSpinBox->setEnabled(true);
        ui->sbusPeriodSpinBox->setEnabled(true);
    } else {
        ui->sbusOutputsSpinBox->setEnabled(false);
        ui->sbusPeriodSpinBox->setEnabled(false);
    }
}


void MainWindow::on_normalFailsafeRadioButton_clicked()
{
    ui->savePresetsPushButton->setEnabled(!ui->normalFailsafeRadioButton->isChecked());
}


void MainWindow::on_presetFailsafeRadioButton_clicked()
{
    ui->savePresetsPushButton->setEnabled(!ui->normalFailsafeRadioButton->isChecked());
}

void MainWindow::onChannelTimout()
{
    buffer[0] = GET_CHANNELS;
    usb.SendReport(buffer);
    usb.GetReport(buffer);
    uint16_t *channels = (uint16_t *)buffer;
    for (int i = 0; i < 12; ++i) {
        if (channels[i] == 0xffff) {
            channelBars[i]->setEnabled(false);
            channelBars[i]->setValue(0);
        } else {
            channelBars[i]->setEnabled(true);
            channelBars[i]->setValue(channels[i]);
        }
    }
}


void MainWindow::on_savePresetsPushButton_clicked()
{
    buffer[0] = SET_PRESETS;
    usb.SendReport(buffer);
    usb.GetReport(buffer);
    if (buffer[0] == CMD_ACK) {
        ui->statusbar->showMessage("Presets saved", 2000);
    } else {
        QMessageBox::critical(this, QApplication::applicationName(), "Unable to save presets");
    }
}


void MainWindow::on_tabWidget_currentChanged(int index)
{
    channelsTimer->stop();
    sensorTimer->stop();
    if (ui->tabWidget->tabText(index) == "Receiver") {
        channelsTimer->start(100);
    } else if (ui->tabWidget->tabText(index) == "Sensors") {
        sensorTimer->start(100);
    }
}

void MainWindow::onSensorTimout()
{
    buffer[0] = GET_SENSORS;
    usb.SendReport(buffer);
    usb.GetReport(buffer);
    int16_t *data = (int16_t *)buffer;
    ui->xAccel->setText(QString().setNum(data[3]));
    ui->yAccel->setText(QString().setNum(data[4]));
    ui->zAccel->setText(QString().setNum(data[5]));
    ui->xGyro->setText(QString().setNum(data[0]));
    ui->yGyro->setText(QString().setNum(data[1]));
    ui->zGyro->setText(QString().setNum(data[2]));
}

